Repository: thorgate/django-esteid
Catalog: esteid/locale/*/LC_MESSAGES/django.po
Languages: et, ru

source: Something went wrong
et: Midagi läks valesti
ru: Что-то пошло не так.

source: Operation is in progress.
ru: Операция в процессе обработки.

source: The {service} service reported a failure.
et: Teenus {service} teatas ebaõnnestumisest.
ru: Сервис {service} сообщил об ошибке.

source: The {service} service is unavailable at the moment. Please try again later.
et: Teenus {service} ei ole hetkel kättesaadav. Palun proovige hiljem uuesti.
ru: Сервис {service} в данный момент недоступен. Пожалуйста, повторите позже.

source: Operation with user certificate level ADVANCED not allowed.
et: Operatsioon kasutajasertifikaadi tasemega ADVANCED ei ole lubatud
ru: Операция с пользователем, чей сертификат уровня ADVANCED, не разрешена.

source: A signing session is already in progress.
et: Allkirjastamise sessioon on juba käsil
ru: Сессия цифровой подписи уже в процессе.

source: No signing session found.
et: Allkirjastamise sessiooni ei leitud
ru: Сессия цифровой подписи не найдена

source: Invalid parameters.
et: Vigased parameetrid.
ru: Некорректные параметры.

source: Invalid value for parameter {param}.
et: Vigane väärtus parameetri {param} jaoks.
ru: Некорректное значение параметра {param}.

source: Invalid ID code.
et: Vale isikukood.
ru: Некорректный ИД код.

source: User not registered in the service.
et: Kasutaja pole registreeritud.
ru: Пользователь не зарегистрирован в системе.

source: The signing operation was canceled by the user.
et: Allkirjastamine tühistati kasutaja poolt.
ru: Операция цифровой подписи была отменена пользователем.

source: The signing operation timed out.
et: Allkirjastamise operatsiooni ajaaken aegus.
ru: Время ожидания подтверждения цифровой подписи истекло.

source: The container has been already signed by the user.
et: Antud Konteiner on juba selle kasutaja poolt allkirjastatud.
ru: Этот документ был уже подписан этим пользователем.

source: Authenticate
et: Isikut tuvastama
ru: Авторизуйтесь

source: Sign
et: Allkirjasta
ru: Подпишите

source: Internal server error
et: Viga serveri sisemuses
ru: Внутренняя ошибка сервера

source: SmartIDService
et: Smart-ID Teenus
ru: Сервис SmartID
